TexasInstruments/ProcessorSDK/mcu_plus_sdk/tools/sysfw/k3-resource-partitioning/out/j784s4-evm.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "J784S4_TDA4AP_TDA4VP_TDA4AH_TDA4VH_AM69x" --package "ALY" --part "Default" --product "K3-Respart-Tool@1.0"
 * @versions {"tool":"1.19.0+3426"}
 */

/**
 * Import the modules used in this configuration.
 */
const A72_2            = scripting.addModule("/modules/j784s4/A72_2");
const A72_3            = scripting.addModule("/modules/j784s4/A72_3");
const C7X_0_1          = scripting.addModule("/modules/j784s4/C7X_0_1");
const C7X_1_1          = scripting.addModule("/modules/j784s4/C7X_1_1");
const C7X_2_1          = scripting.addModule("/modules/j784s4/C7X_2_1");
const C7X_3_1          = scripting.addModule("/modules/j784s4/C7X_3_1");
const MAIN_0_R5_0      = scripting.addModule("/modules/j784s4/MAIN_0_R5_0");
const MAIN_0_R5_2      = scripting.addModule("/modules/j784s4/MAIN_0_R5_2");
const MAIN_1_R5_0      = scripting.addModule("/modules/j784s4/MAIN_1_R5_0");
const MAIN_1_R5_2      = scripting.addModule("/modules/j784s4/MAIN_1_R5_2");
const MAIN_2_R5_0      = scripting.addModule("/modules/j784s4/MAIN_2_R5_0");
const MAIN_2_R5_2      = scripting.addModule("/modules/j784s4/MAIN_2_R5_2");
const MCU_0_R5_0       = scripting.addModule("/modules/j784s4/MCU_0_R5_0");
const MCU_0_R5_2       = scripting.addModule("/modules/j784s4/MCU_0_R5_2");
const resourceSharing  = scripting.addModule("/modules/resourceSharing", {}, false);
const resourceSharing1 = resourceSharing.addInstance();
const resourceSharing2 = resourceSharing.addInstance();
const resourceSharing3 = resourceSharing.addInstance();
const resourceSharing4 = resourceSharing.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
A72_2.allocOrder                                                 = 1;
A72_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount     = 6;
A72_2.Main_NAVSS_UDMA_Rx_free_flows_count                        = 16;
A72_2.Main_NAVSS_Ring_accelerator_ring_monitors_count            = 3;
A72_2.Main_NAVSS_Non_secure_proxies_count                        = 4;
A72_2.Main_NAVSS_Ring_accelerator_virt_id_range_count            = 5;
A72_2.MCU_NAVSS_UDMA_Rx_free_flows_count                         = 8;
A72_2.MCU_NAVSS_Ring_accelerator_Free_rings_count                = 20;
A72_2.MCU_NAVSS_Ring_accelerator_ring_monitors_count             = 3;
A72_2.MCU_NAVSS_Non_secure_proxies_count                         = 2;
A72_2.Main_GPIO_Interrupt_router_count                           = 12;
A72_2.Wakeup_GPIO_Interrupt_router_count                         = 6;
A72_2.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count   = 1024;
A72_2.MCU_NAVSS_Interrupt_aggregator_Global_events_count         = 128;
A72_2.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count           = 8;
A72_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count           = 8;
A72_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount      = 3;
A72_2.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count    = 32;
A72_2.Main_NAVSS_Interrupt_router_count                          = 80;
A72_2.Main_NAVSS_UDMA_Ultra_High_capacity_Tx_channels_blockCount = 1;
A72_2.Main_NAVSS_UDMA_High_capacity_Tx_channels_blockCount       = 1;
A72_2.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count   = 56;
A72_2.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count          = 25;
A72_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count          = 25;
A72_2.Main_NAVSS_Ring_accelerator_Free_rings_count               = 128;

A72_3.allocOrder                                               = 2;
A72_3.Main_NAVSS_UDMA_Rx_free_flows_count                      = 16;
A72_3.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 2;
A72_3.Main_NAVSS_Non_secure_proxies_count                      = 4;
A72_3.Main_NAVSS_Ring_accelerator_virt_id_range_start          = 5;
A72_3.Main_NAVSS_Ring_accelerator_virt_id_range_count          = 1;
A72_3.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 4;
A72_3.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
A72_3.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
A72_3.MCU_NAVSS_Non_secure_proxies_count                       = 4;
A72_3.Main_GPIO_Interrupt_router_count                         = 12;
A72_3.Wakeup_GPIO_Interrupt_router_count                       = 6;
A72_3.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 512;
A72_3.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 4;
A72_3.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 4;
A72_3.Main_NAVSS_Interrupt_router_count                        = 14;
A72_3.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 24;
A72_3.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 1;
A72_3.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 1;
A72_3.Main_NAVSS_Ring_accelerator_Free_rings_count             = 10;

C7X_0_1.allocOrder                                               = 3;
C7X_0_1.Main_NAVSS_UDMA_Extended_Tx_channels_count               = 8;
C7X_0_1.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
C7X_0_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
C7X_0_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
C7X_0_1.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 3;
C7X_0_1.Main_NAVSS_Non_secure_proxies_count                      = 4;
C7X_0_1.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
C7X_0_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
C7X_0_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
C7X_0_1.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
C7X_0_1.MCU_NAVSS_Non_secure_proxies_count                       = 4;
C7X_0_1.Main_NAVSS_Interrupt_router_count                        = 21;
C7X_0_1.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 12;
C7X_0_1.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
C7X_0_1.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
C7X_0_1.Main_NAVSS_Ring_accelerator_Free_rings_count             = 10;

C7X_1_1.allocOrder                                               = 4;
C7X_1_1.Main_NAVSS_UDMA_Extended_Tx_channels_count               = 8;
C7X_1_1.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
C7X_1_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
C7X_1_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
C7X_1_1.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 3;
C7X_1_1.Main_NAVSS_Non_secure_proxies_count                      = 4;
C7X_1_1.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
C7X_1_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
C7X_1_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
C7X_1_1.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
C7X_1_1.MCU_NAVSS_Non_secure_proxies_count                       = 4;
C7X_1_1.Main_NAVSS_Interrupt_router_count                        = 21;
C7X_1_1.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 12;
C7X_1_1.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
C7X_1_1.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
C7X_1_1.Main_NAVSS_Ring_accelerator_Free_rings_count             = 20;

C7X_2_1.allocOrder                                               = 5;
C7X_2_1.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
C7X_2_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
C7X_2_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
C7X_2_1.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 1;
C7X_2_1.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
C7X_2_1.MCU_NAVSS_Non_secure_proxies_count                       = 4;
C7X_2_1.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
C7X_2_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
C7X_2_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
C7X_2_1.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
C7X_2_1.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
C7X_2_1.Main_NAVSS_UDMA_Extended_Tx_channels_count               = 6;
C7X_2_1.Main_NAVSS_Non_secure_proxies_count                      = 4;
C7X_2_1.Main_NAVSS_Interrupt_router_count                        = 12;
C7X_2_1.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 10;
C7X_2_1.Main_NAVSS_Ring_accelerator_Free_rings_count             = 16;

