TexasInstruments/ProcessorSDK/mcu_plus_sdk/tools/sysfw/k3-resource-partitioning/out/j784s4-evm.syscfg
C7X_3_1.allocOrder                                               = 6;
C7X_3_1.Main_NAVSS_UDMA_Extended_Tx_channels_count               = 4;
C7X_3_1.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
C7X_3_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
C7X_3_1.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
C7X_3_1.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 1;
C7X_3_1.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
C7X_3_1.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
C7X_3_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
C7X_3_1.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
C7X_3_1.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
C7X_3_1.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
C7X_3_1.Main_NAVSS_Non_secure_proxies_count                      = 4;
C7X_3_1.MCU_NAVSS_Non_secure_proxies_count                       = 4;
C7X_3_1.Main_NAVSS_Interrupt_router_count                        = 12;
C7X_3_1.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 10;
C7X_3_1.Main_NAVSS_Ring_accelerator_Free_rings_count             = 13;

MAIN_0_R5_0.allocOrder                                                 = 7;
MAIN_0_R5_0.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count          = 12;
MAIN_0_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count          = 12;
MAIN_0_R5_0.Main_NAVSS_UDMA_Extended_Tx_channels_count                 = 2;
MAIN_0_R5_0.Main_NAVSS_Ring_accelerator_ring_monitors_count            = 6;
MAIN_0_R5_0.Main_NAVSS_Non_secure_proxies_count                        = 12;
MAIN_0_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count           = 2;
MAIN_0_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count           = 2;
MAIN_0_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount      = 1;
MAIN_0_R5_0.MCU_NAVSS_UDMA_Rx_free_flows_count                         = 8;
MAIN_0_R5_0.MCU_NAVSS_Ring_accelerator_Free_rings_count                = 16;
MAIN_0_R5_0.MCU_NAVSS_Ring_accelerator_ring_monitors_count             = 3;
MAIN_0_R5_0.MCU_NAVSS_Non_secure_proxies_count                         = 16;
MAIN_0_R5_0.Main_NAVSS_Interrupt_router_count                          = 28;
MAIN_0_R5_0.Main_GPIO_Interrupt_router_count                           = 4;
MAIN_0_R5_0.Wakeup_GPIO_Interrupt_router_count                         = 2;
MAIN_0_R5_0.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count   = 28;
MAIN_0_R5_0.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count   = 512;
MAIN_0_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount     = 4;
MAIN_0_R5_0.Main_NAVSS_UDMA_Ultra_High_capacity_Tx_channels_blockCount = 1;
MAIN_0_R5_0.Main_NAVSS_UDMA_High_capacity_Tx_channels_blockCount       = 1;
MAIN_0_R5_0.Main_NAVSS_UDMA_Extended_Tx_channels_hwa_start             = 117;
MAIN_0_R5_0.Main_NAVSS_UDMA_Extended_Tx_channels_hwa_count             = 96;
MAIN_0_R5_0.Main_NAVSS_Ring_accelerator_Free_rings_count               = 128;
MAIN_0_R5_0.Main_NAVSS_Block_Copy_DMA_Split_TR_Rx_channels_count       = 32;
MAIN_0_R5_0.Main_NAVSS_Block_Copy_DMA_Split_TR_Tx_channels_count       = 16;

MAIN_0_R5_2.allocOrder                                               = 8;
MAIN_0_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
MAIN_0_R5_2.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 1;
MAIN_0_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 4;
MAIN_0_R5_2.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 3;
MAIN_0_R5_2.Main_NAVSS_Non_secure_proxies_count                      = 4;
MAIN_0_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
MAIN_0_R5_2.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 4;
MAIN_0_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
MAIN_0_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
MAIN_0_R5_2.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
MAIN_0_R5_2.MCU_NAVSS_Non_secure_proxies_count                       = 4;
MAIN_0_R5_2.Main_NAVSS_Interrupt_router_count                        = 28;
MAIN_0_R5_2.Main_GPIO_Interrupt_router_count                         = 4;
MAIN_0_R5_2.Wakeup_GPIO_Interrupt_router_count                       = 2;
MAIN_0_R5_2.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 8;
MAIN_0_R5_2.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
MAIN_0_R5_2.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
MAIN_0_R5_2.Main_NAVSS_UDMA_Extended_Tx_channels_count               = 2;
MAIN_0_R5_2.Main_NAVSS_UDMA_Extended_Tx_channels_hwa_start           = 309;
MAIN_0_R5_2.Main_NAVSS_UDMA_Extended_Tx_channels_hwa_count           = 32;
MAIN_0_R5_2.Main_NAVSS_Ring_accelerator_Free_rings_count             = 46;

MAIN_1_R5_0.allocOrder                                               = 9;
MAIN_1_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
MAIN_1_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
MAIN_1_R5_0.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
MAIN_1_R5_0.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 3;
MAIN_1_R5_0.Main_NAVSS_Non_secure_proxies_count                      = 4;
MAIN_1_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
MAIN_1_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
MAIN_1_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
MAIN_1_R5_0.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 4;
MAIN_1_R5_0.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
MAIN_1_R5_0.MCU_NAVSS_Non_secure_proxies_count                       = 4;
MAIN_1_R5_0.Main_NAVSS_Interrupt_router_count                        = 28;
MAIN_1_R5_0.Main_GPIO_Interrupt_router_count                         = 4;
MAIN_1_R5_0.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 12;
MAIN_1_R5_0.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
MAIN_1_R5_0.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
MAIN_1_R5_0.Main_NAVSS_Ring_accelerator_Free_rings_count             = 10;

MAIN_1_R5_2.allocOrder                                               = 10;
MAIN_1_R5_2.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
MAIN_1_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
MAIN_1_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
MAIN_1_R5_2.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 3;
MAIN_1_R5_2.Main_NAVSS_Non_secure_proxies_count                      = 4;
MAIN_1_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
MAIN_1_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
MAIN_1_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
MAIN_1_R5_2.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 4;
MAIN_1_R5_2.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
MAIN_1_R5_2.MCU_NAVSS_Non_secure_proxies_count                       = 4;
MAIN_1_R5_2.Main_NAVSS_Interrupt_router_count                        = 28;
MAIN_1_R5_2.Main_GPIO_Interrupt_router_count                         = 4;
MAIN_1_R5_2.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
MAIN_1_R5_2.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 8;
MAIN_1_R5_2.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
MAIN_1_R5_2.Main_NAVSS_Ring_accelerator_Free_rings_count             = 20;

