TexasInstruments/ProcessorSDK/mcu_plus_sdk/tools/sysfw/k3-resource-partitioning/out/j784s4-evm.syscfg
MAIN_2_R5_0.allocOrder                                               = 11;
MAIN_2_R5_0.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 1;
MAIN_2_R5_0.Main_NAVSS_Non_secure_proxies_count                      = 4;
MAIN_2_R5_0.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 8;
MAIN_2_R5_0.Main_GPIO_Interrupt_router_count                         = 4;
MAIN_2_R5_0.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
MAIN_2_R5_0.Main_NAVSS_Interrupt_router_count                        = 28;
MAIN_2_R5_0.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
MAIN_2_R5_0.MCU_NAVSS_Non_secure_proxies_count                       = 3;
MAIN_2_R5_0.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 2;
MAIN_2_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
MAIN_2_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
MAIN_2_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
MAIN_2_R5_0.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 10;
MAIN_2_R5_0.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
MAIN_2_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
MAIN_2_R5_0.Main_NAVSS_UDMA_Extended_Tx_channels_hwa_start           = 213;
MAIN_2_R5_0.Main_NAVSS_UDMA_Extended_Tx_channels_hwa_count           = 96;
MAIN_2_R5_0.Main_NAVSS_Ring_accelerator_Free_rings_count             = 64;
MAIN_2_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 3;

MAIN_2_R5_2.allocOrder                                               = 12;
MAIN_2_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;
MAIN_2_R5_2.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 1;
MAIN_2_R5_2.Main_NAVSS_Non_secure_proxies_count                      = 4;
MAIN_2_R5_2.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 4;
MAIN_2_R5_2.Main_GPIO_Interrupt_router_count                         = 4;
MAIN_2_R5_2.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 256;
MAIN_2_R5_2.Main_NAVSS_Interrupt_router_count                        = 28;
MAIN_2_R5_2.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 2;
MAIN_2_R5_2.MCU_NAVSS_Non_secure_proxies_count                       = 2;
MAIN_2_R5_2.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 2;
MAIN_2_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 1;
MAIN_2_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 1;
MAIN_2_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 1;
MAIN_2_R5_2.Main_NAVSS_Interrupt_aggregator_Virtual_interrupts_count = 10;
MAIN_2_R5_2.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count        = 2;
MAIN_2_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count        = 2;
MAIN_2_R5_2.Main_NAVSS_Ring_accelerator_Free_rings_count             = 10;

MCU_0_R5_0.allocOrder                                               = 13;
MCU_0_R5_0.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 1;
MCU_0_R5_0.Main_NAVSS_Non_secure_proxies_count                      = 4;
MCU_0_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 3;
MCU_0_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount    = 2;
MCU_0_R5_0.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 3;
MCU_0_R5_0.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 8;
MCU_0_R5_0.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 32;
MCU_0_R5_0.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 3;
MCU_0_R5_0.MCU_NAVSS_Non_secure_proxies_count                       = 4;
MCU_0_R5_0.MCU_NAVSS_UDMA_High_capacity_Tx_channels_count           = 2;
MCU_0_R5_0.MCU_NAVSS_UDMA_High_capacity_Rx_channels_count           = 2;
MCU_0_R5_0.Main_NAVSS_Interrupt_router_count                        = 4;
MCU_0_R5_0.MCU_NAVSS_Interrupt_router_count                         = 12;
MCU_0_R5_0.Wakeup_GPIO_Interrupt_router_count                       = 8;
MCU_0_R5_0.Main_2_MCU_Level_Interrupt_router_count                  = 32;
MCU_0_R5_0.Main_2_MCU_Pulse_Interrupt_router_count                  = 24;
MCU_0_R5_0.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 32;
MCU_0_R5_0.MCU_NAVSS_Interrupt_aggregator_Global_events_count       = 256;
MCU_0_R5_0.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count  = 64;
MCU_0_R5_0.Main_GPIO_Interrupt_router_count                         = 4;
MCU_0_R5_0.Main_NAVSS_Ring_accelerator_Free_rings_count             = 4;
MCU_0_R5_0.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;

MCU_0_R5_2.allocOrder                                               = 14;
MCU_0_R5_2.Main_NAVSS_Ring_accelerator_ring_monitors_count          = 1;
MCU_0_R5_2.Main_NAVSS_Non_secure_proxies_count                      = 4;
MCU_0_R5_2.MCU_NAVSS_Ring_accelerator_Free_rings_count              = 12;
MCU_0_R5_2.MCU_NAVSS_Ring_accelerator_ring_monitors_count           = 3;
MCU_0_R5_2.MCU_NAVSS_Non_secure_proxies_count                       = 4;
MCU_0_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count         = 2;
MCU_0_R5_2.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count         = 2;
MCU_0_R5_2.Main_NAVSS_Interrupt_router_count                        = 4;
MCU_0_R5_2.Wakeup_GPIO_Interrupt_router_count                       = 8;
MCU_0_R5_2.MCU_NAVSS_Interrupt_router_count                         = 20;
MCU_0_R5_2.Main_2_MCU_Level_Interrupt_router_count                  = 24;
MCU_0_R5_2.Main_2_MCU_Pulse_Interrupt_router_count                  = 16;
MCU_0_R5_2.MCU_NAVSS_Interrupt_aggregator_Global_events_count       = 64;
MCU_0_R5_2.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count = 32;
MCU_0_R5_2.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count  = 4;
MCU_0_R5_2.Main_GPIO_Interrupt_router_count                         = 4;
MCU_0_R5_2.MCU_NAVSS_UDMA_Rx_free_flows_count                       = 4;
MCU_0_R5_2.Main_NAVSS_Ring_accelerator_Free_rings_count             = 4;
MCU_0_R5_2.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_blockCount   = 1;

resourceSharing1.$name              = "MAIN_NAVSS_BCDMA_RX";
resourceSharing1.resourceName       = "Main NAVSS Block Copy DMA Split TR Rx channels";
resourceSharing1.sharedFromHostName = "MAIN_0_R5_0";
resourceSharing1.sharedToHostName   = "A72_2";

resourceSharing2.$name              = "MAIN_NAVSS_BCDMA_TX";
resourceSharing2.resourceName       = "Main NAVSS Block Copy DMA Split TR Tx channels";
resourceSharing2.sharedFromHostName = "MAIN_0_R5_0";
resourceSharing2.sharedToHostName   = "A72_2";

resourceSharing3.$name              = "MAIN_NAVSS_BCDMA_RX_RING";
resourceSharing3.resourceName       = "Main NAVSS Block Copy DMA Rings for Split TR RX channels";
resourceSharing3.sharedFromHostName = "MAIN_0_R5_0";
resourceSharing3.sharedToHostName   = "A72_2";

resourceSharing4.$name              = "MAIN_NAVSS_BCDMA_TX_RING";
resourceSharing4.resourceName       = "Main NAVSS Block Copy DMA Rings for Split TR TX channels";
resourceSharing4.sharedFromHostName = "MAIN_0_R5_0";
resourceSharing4.sharedToHostName   = "A72_2";
